{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/rwe2/Documents/BYU Economics/Data/rGDPrecessComp/rGDPrecessComp.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}27 Jan 2014, 21:31:11
{txt}
{com}. set more off ;
{txt}
{com}. clear ;
{txt}
{com}. set memory 20m ;
{txt}
{com}. *---------------------------------------------------------------------------- ;
. * Get data ;
. insheet datetextqtr rGDPqtr using GDPC962014-01.csv, comma names clear ;
{txt}(2 vars, 267 obs)

{com}. gen double rGDPqtr2 = rgdpqtr ;
{txt}
{com}. drop rgdpqtr ;
{txt}
{com}. rename rGDPqtr2 rGDPqtr ;
{txt}
{com}. label variable rGDPqtr "Real GDP (quarter)" ;
{txt}
{com}. label variable datetextqtr "Date (text format)" ;
{txt}
{com}. gen double dateqtr = date(datetextqtr,"MDY", 2014) ;
{txt}
{com}. label variable dateqtr "Date" ;
{txt}
{com}. format dateqtr %tdCCYY!-Mon!-DD ;
{txt}
{com}. order datetextqtr dateqtr rGDPqtr ;
{txt}
{com}. tsset dateqtr, daily ;
{res}{txt}{col 9}time variable:  {res}{col 25}dateqtr, 1947-Jan-01 to 2013-Jul-01, but with gaps
{txt}{col 17}delta:  {res}1 day
{txt}
{com}. sort dateqtr ;
{txt}
{com}. gen qtrdata = 1 ;
{txt}
{com}. tempfile rGDPqtrfile ;
{txt}
{com}. save `rGDPqtrfile', replace ;
{txt}(note: file /var/folders/k3/_lljn45552xd3tv__dp27q1r8d_ff6/T//S_60205.000001 not found)
file /var/folders/k3/_lljn45552xd3tv__dp27q1r8d_ff6/T//S_60205.000001 saved

{com}. insheet datetextann rGDPann using GDPCA.txt, comma names clear ;
{txt}(2 vars, 80 obs)

{com}. gen double rGDPann2 = rgdpann ;
{txt}
{com}. drop rgdpann ;
{txt}
{com}. rename rGDPann2 rGDPann ;
{txt}
{com}. label variable rGDPann "Real GDP (annual)" ;
{txt}
{com}. label variable datetextann "Date (text format)" ;
{txt}
{com}. gen double dateann = date(datetextann,"YMD", 2008) ;
{txt}
{com}. label variable dateann "Date" ;
{txt}
{com}. format dateann %tdCCYY!-Mon!-DD ;
{txt}
{com}. order datetextann dateann rGDPann ;
{txt}
{com}. tsset dateann, daily ;
{res}{txt}{col 9}time variable:  {res}{col 25}dateann, 1929-Jan-01 to 2008-Jan-01, but with gaps
{txt}{col 17}delta:  {res}1 day
{txt}
{com}. sort dateann ;
{txt}
{com}. gen anndata = 1 ;
{txt}
{com}. append using `rGDPqtrfile' ;
{txt}
{com}. *---------------------------------------------------------------------------- ;
. * Generate some new variables ;
. gen int  yearann  = year(dateann) ;
{txt}(267 missing values generated)

{com}. gen int  yearqtr  = year(dateqtr) ;
{txt}(80 missing values generated)

{com}. gen byte monthann = month(dateann) ;
{txt}(267 missing values generated)

{com}. gen byte monthqtr = month(dateqtr) ;
{txt}(80 missing values generated)

{com}. gen byte quarterann = quarter(dateann) ;
{txt}(267 missing values generated)

{com}. gen byte quarterqtr = quarter(dateqtr) ;
{txt}(80 missing values generated)

{com}. label variable yearann "Year" ;
{txt}
{com}. label variable yearqtr "Year" ;
{txt}
{com}. label variable monthann "Month" ;
{txt}
{com}. label variable monthqtr "Month" ;
{txt}
{com}. label variable quarterann "Quarter" ;
{txt}
{com}. label variable quarterqtr "Quarter" ;
{txt}
{com}. generate periodann = _n if anndata == 1 ;
{txt}(267 missing values generated)

{com}. generate periodqtr = _n if qtrdata == 1 ;
{txt}(80 missing values generated)

{com}. *---------------------------------------------------------------------------- ;
. * Create normalized peak series for Recession 1, the Great Depression
>   (Aug 1929-March 1933) ;
. local recnum = 1 ;
{txt}
{com}. *graph twoway line rGDPann dateann if dateann >= mdy(8,1,1927) &
>    dateann <= mdy(3,31,1933) ;
. sum rGDPann if dateann >= mdy(8,1,1927) & dateann <= mdy(3,31,1933) ;

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}rGDPann {c |}{res}         5         735    97.87043      635.5      865.2
{txt}
{com}. local rec`recnum'max = r(max) ;
{txt}
{com}. display `rec`recnum'max' ;
{res}865.20001
{txt}
{com}. sum periodann if rGDPann == `rec`recnum'max' & dateann >= mdy(8,1,1927) &
>    dateann <= mdy(3,31,1933) ;

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}periodann {c |}{res}         1           1           .          1          1
{txt}
{com}. local zero`recnum'per = r(min) ;
{txt}
{com}. display `zero`recnum'per' ;
{res}1
{txt}
{com}. sum dateann if periodann == `zero`recnum'per' ;

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}dateann {c |}{res}         1      -11322           .     -11322     -11322
{txt}
{com}. local zero`recnum'perdate = r(mean) ;
{txt}
{com}. local rec`recnum'firstperdate = `zero`recnum'perdate' - (365*2) ;
{txt}
{com}. local rec`recnum'lastperdate  = `zero`recnum'perdate' + (365*6) + 10 ;
{txt}
{com}. count if dateann >= `rec`recnum'firstperdate' & dateann <= `rec`recnum'lastperdate' ;
{res}    7
{txt}
{com}. local rec`recnum'pers = r(N) ;
{txt}
{com}. gen rGDPannrec`recnum' = rGDPann/`rec`recnum'max' if dateann >=
>    `rec`recnum'firstperdate' & dateann <= `rec`recnum'lastperdate' ;
{txt}(340 missing values generated)

{com}. label variable rGDPannrec`recnum' "1929-1933" ;
{txt}
{com}. gen comprecper`recnum' =  dateann - `zero`recnum'perdate' if dateann >=
>    `rec`recnum'firstperdate' & dateann <= `rec`recnum'lastperdate' ;
{txt}(340 missing values generated)

{com}. label variable comprecper`recnum' "Days from peak" ;
{txt}
{com}. *---------------------------------------------------------------------------- ;
. * Create normalized peak series for Recession 2 (May 1937-Jun 1938) ;
. local recnum = 2 ;
{txt}
{com}. *graph twoway line rGDPann dateann if dateann >= mdy(1,1,1936) &
>    dateann <= mdy(1,1,1938) ;
. sum rGDPann if dateann >= mdy(1,1,1936) & dateann <= mdy(1,1,1938) ;

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}rGDPann {c |}{res}         3       885.8    22.86853      866.6      911.1
{txt}
{com}. local rec`recnum'max = r(max) ;
{txt}
{com}. display `rec`recnum'max' ;
{res}911.09998
{txt}
{com}. sum periodann if rGDPann == `rec`recnum'max' & dateann >= mdy(1,1,1936) &
>    dateann <= mdy(1,1,1938) ;

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}periodann {c |}{res}         1           9           .          9          9
{txt}
{com}. local zero`recnum'per = r(min) ;
{txt}
{com}. display `zero`recnum'per' ;
{res}9
{txt}
{com}. sum dateann if periodann == `zero`recnum'per' ;

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}dateann {c |}{res}         1       -8400           .      -8400      -8400
{txt}
{com}. local zero`recnum'perdate = r(mean) ;
{txt}
{com}. local rec`recnum'firstperdate = `zero`recnum'perdate' - (365*2) - 10 ;
{txt}
{com}. local rec`recnum'lastperdate  = `zero`recnum'perdate' + (365*6) + 10 ;
{txt}
{com}. count if dateann >= `rec`recnum'firstperdate' & dateann <= `rec`recnum'lastperdate' ;
{res}    9
{txt}
{com}. local rec`recnum'pers = r(N) ;
{txt}
{com}. gen rGDPannrec`recnum' = rGDPann/`rec`recnum'max' if dateann >=
>    `rec`recnum'firstperdate' & dateann <= `rec`recnum'lastperdate' ;
{txt}(338 missing values generated)

{com}. label variable rGDPannrec`recnum' "1935-1941" ;
{txt}
{com}. gen comprecper`recnum' =  dateann - `zero`recnum'perdate' if dateann >=
>    `rec`recnum'firstperdate' & dateann <= `rec`recnum'lastperdate' ;
{txt}(338 missing values generated)

{com}. label variable comprecper`recnum' "Days from peak" ;
{txt}
{com}. *---------------------------------------------------------------------------- ;
. * Create normalized peak series for Recession 3 (Feb 1945-Oct 1945) ;
. local recnum = 3 ;
{txt}
{com}. *graph twoway line rGDPann dateann if dateann >= mdy(1,1,1944) &
>    dateann <= mdy(4,1,1946) ;
. sum rGDPann if dateann >= mdy(1,1,1944) & dateann <= mdy(4,1,1945) ;

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}rGDPann {c |}{res}         2      1796.4    14.28352     1786.3     1806.5
{txt}
{com}. local rec`recnum'max = r(max) ;
{txt}
{com}. display `rec`recnum'max' ;
{res}1806.5
{txt}
{com}. sum periodann if rGDPann == `rec`recnum'max' & dateann >= mdy(1,1,1944) &
>    dateann <= mdy(4,1,1945) ;

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}periodann {c |}{res}         1          16           .         16         16
{txt}
{com}. local zero`recnum'per = r(min) ;
{txt}
{com}. display `zero`recnum'per' ;
{res}16
{txt}
{com}. sum dateann if periodann == `zero`recnum'per' ;

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}dateann {c |}{res}         1       -5844           .      -5844      -5844
{txt}
{com}. local zero`recnum'perdate = r(mean) ;
{txt}
{com}. local rec`recnum'firstperdate = `zero`recnum'perdate' - (365*2) - 10 ;
{txt}
{com}. local rec`recnum'lastperdate  = `zero`recnum'perdate' + (365*6) + 10 ;
{txt}
{com}. count if dateann >= `rec`recnum'firstperdate' & dateann <= `rec`recnum'lastperdate' ;
{res}    9
{txt}
{com}. local rec`recnum'pers = r(N) ;
{txt}
{com}. gen rGDPannrec`recnum' = rGDPann/`rec`recnum'max' if dateann >=
>    `rec`recnum'firstperdate' & dateann <= `rec`recnum'lastperdate' ;
{txt}(338 missing values generated)

{com}. label variable rGDPannrec`recnum' "1943-1949" ;
{txt}
{com}. gen comprecper`recnum' =  dateann - `zero`recnum'perdate' if dateann >=
>    `rec`recnum'firstperdate' & dateann <= `rec`recnum'lastperdate' ;
{txt}(338 missing values generated)

{com}. label variable comprecper`recnum' "Days from peak" ;
{txt}
{com}. *---------------------------------------------------------------------------- ;
. * Create normalized peak series for Recession 4 (Nov 1948-Oct 1949) ;
. local recnum = 4 ;
{txt}
{com}. *graph twoway line rGDPqtr dateqtr if dateqtr >= mdy(4,1,1948) &
>    dateqtr <= mdy(1,1,1949) ;
. sum rGDPqtr if dateqtr >= mdy(4,1,1948) & dateqtr <= mdy(1,1,1949) ;

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}rGDPqtr {c |}{res}         4    2022.495    12.73659   2005.563   2033.347
{txt}
{com}. local rec`recnum'max = r(max) ;
{txt}
{com}. display `rec`recnum'max' ;
{res}2033.347
{txt}
{com}. sum periodqtr if rGDPqtr == `rec`recnum'max' & dateqtr >= mdy(5,1,1948) &
>    dateqtr <= mdy(1,1,1949) ;

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}periodqtr {c |}{res}         0
{txt}
{com}. local zero`recnum'per = r(min) ;
{txt}
{com}. display `zero`recnum'per' ;
{res}.
{txt}
{com}. sum dateqtr if periodqtr == `zero`recnum'per' ;

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}dateqtr {c |}{res}         0
{txt}
{com}. local zero`recnum'perdate = r(mean) ;
{txt}
{com}. local rec`recnum'firstperdate = `zero`recnum'perdate' - (365*2) - 10 ;
{txt}
{com}. local rec`recnum'lastperdate  = `zero`recnum'perdate' + (365*6) + 10 ;
{txt}
{com}. count if dateqtr >= `rec`recnum'firstperdate' & dateqtr <= `rec`recnum'lastperdate' ;
{res}   80
{txt}
{com}. local rec`recnum'pers = r(N) ;
{txt}
{com}. gen rGDPqtrrec`recnum' = rGDPqtr/`rec`recnum'max' if dateqtr >=
>    `rec`recnum'firstperdate' & dateqtr <= `rec`recnum'lastperdate' ;
{txt}(347 missing values generated)

{com}. label variable rGDPqtrrec`recnum' "1946-1952" ;
{txt}
{com}. gen comprecper`recnum' =  dateqtr - `zero`recnum'perdate' if dateqtr >=
>    `rec`recnum'firstperdate' & dateqtr <= `rec`recnum'lastperdate' ;
{txt}(347 missing values generated)

{com}. label variable comprecper`recnum' "Days from peak" ;
{txt}
{com}. *---------------------------------------------------------------------------- ;
. * Create normalized peak series for Recession 5 (Jul 1953-May 1954) ;
. local recnum = 5 ;
{txt}
{com}. *graph twoway line rGDPqtr dateqtr if dateqtr >= mdy(1,1,1953) &
>    dateqtr <= mdy(6,1,1954) ;
. sum rGDPqtr if dateqtr >= mdy(1,1,1953) & dateqtr <= mdy(6,1,1954) ;

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}rGDPqtr {c |}{res}         6    2554.919    27.91728   2525.611   2590.964
{txt}
{com}. local rec`recnum'max = r(max) ;
{txt}
{com}. display `rec`recnum'max' ;
{res}2590.9641
{txt}
{com}. sum periodqtr if rGDPqtr == `rec`recnum'max' & dateqtr >= mdy(1,1,1953) &
>    dateqtr <= mdy(6,1,1954) ;

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}periodqtr {c |}{res}         1         106           .        106        106
{txt}
{com}. local zero`recnum'per = r(min) ;
{txt}
{com}. display `zero`recnum'per' ;
{res}106
{txt}
{com}. sum dateqtr if periodqtr == `zero`recnum'per' ;

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}dateqtr {c |}{res}         1       -2466           .      -2466      -2466
{txt}
{com}. local zero`recnum'perdate = r(mean) ;
{txt}
{com}. local rec`recnum'firstperdate = `zero`recnum'perdate' - (365*2) - 10 ;
{txt}
{com}. local rec`recnum'lastperdate  = `zero`recnum'perdate' + (365*6) + 10 ;
{txt}
{com}. count if dateqtr >= `rec`recnum'firstperdate' & dateqtr <= `rec`recnum'lastperdate' ;
{res}   33
{txt}
{com}. local rec`recnum'pers = r(N) ;
{txt}
{com}. gen rGDPqtrrec`recnum' = rGDPqtr/`rec`recnum'max' if dateqtr >=
>    `rec`recnum'firstperdate' & dateqtr <= `rec`recnum'lastperdate' ;
{txt}(314 missing values generated)

{com}. label variable rGDPqtrrec`recnum' "1951-1957" ;
{txt}
{com}. gen comprecper`recnum' =  dateqtr - `zero`recnum'perdate' if dateqtr >=
>    `rec`recnum'firstperdate' & dateqtr <= `rec`recnum'lastperdate' ;
{txt}(314 missing values generated)

{com}. label variable comprecper`recnum' "Days from peak" ;
{txt}
{com}. *---------------------------------------------------------------------------- ;
. * Create normalized peak series for Recession 6 (Aug 1957-Apr 1958) ;
. local recnum = 6 ;
{txt}
{com}. *graph twoway line rGDPqtr dateqtr if dateqtr >= mdy(1,1,1957) &
>    dateqtr <= mdy(1,1,1958) ;
. sum rGDPqtr if dateqtr >= mdy(1,1,1957) & dateqtr <= mdy(1,1,1958) ;

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}rGDPqtr {c |}{res}         5    2836.824    39.15358       2770   2873.169
{txt}
{com}. local rec`recnum'max = r(max) ;
{txt}
{com}. display `rec`recnum'max' ;
{res}2873.1689
{txt}
{com}. sum periodqtr if rGDPqtr == `rec`recnum'max' & dateqtr >= mdy(1,1,1957) &
>    dateqtr <= mdy(1,1,1958) ;

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}periodqtr {c |}{res}         1         123           .        123        123
{txt}
{com}. local zero`recnum'per = r(min) ;
{txt}
{com}. display `zero`recnum'per' ;
{res}123
{txt}
{com}. sum dateqtr if periodqtr == `zero`recnum'per' ;

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}dateqtr {c |}{res}         1        -914           .       -914       -914
{txt}
{com}. local zero`recnum'perdate = r(mean) ;
{txt}
{com}. local rec`recnum'firstperdate = `zero`recnum'perdate' - (365*2) - 10 ;
{txt}
{com}. local rec`recnum'lastperdate  = `zero`recnum'perdate' + (365*6) + 10 ;
{txt}
{com}. count if dateqtr >= `rec`recnum'firstperdate' & dateqtr <= `rec`recnum'lastperdate' ;
{res}   33
{txt}
{com}. local rec`recnum'pers = r(N) ;
{txt}
{com}. gen rGDPqtrrec`recnum' = rGDPqtr/`rec`recnum'max' if dateqtr >=
>    `rec`recnum'firstperdate' & dateqtr <= `rec`recnum'lastperdate' ;
{txt}(314 missing values generated)

{com}. label variable rGDPqtrrec`recnum' "1955-1961" ;
{txt}
{com}. gen comprecper`recnum' =  dateqtr - `zero`recnum'perdate' if dateqtr >=
>    `rec`recnum'firstperdate' & dateqtr <= `rec`recnum'lastperdate' ;
{txt}(314 missing values generated)

{com}. label variable comprecper`recnum' "Days from peak" ;
{txt}
{com}. *---------------------------------------------------------------------------- ;
. * Create normalized peak series for Recession 7 (Apr 1960-Feb 1961) ;
. local recnum = 7 ;
{txt}
{com}. *graph twoway line rGDPqtr dateqtr if dateqtr >= mdy(6,1,1959) &
>    dateqtr <= mdy(1,1,1961) ;
. sum rGDPqtr if dateqtr >= mdy(6,1,1959) & dateqtr <= mdy(1,1,1961) ;

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}rGDPqtr {c |}{res}         7    3087.827    31.68791   3040.235   3120.195
{txt}
{com}. local rec`recnum'max = r(max) ;
{txt}
{com}. display `rec`recnum'max' ;
{res}3120.1951
{txt}
{com}. sum periodqtr if rGDPqtr == `rec`recnum'max' & dateqtr >= mdy(6,1,1959) &
>    dateqtr <= mdy(1,1,1961) ;

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}periodqtr {c |}{res}         1         133           .        133        133
{txt}
{com}. local zero`recnum'per = r(min) ;
{txt}
{com}. display `zero`recnum'per' ;
{res}133
{txt}
{com}. sum dateqtr if periodqtr == `zero`recnum'per' ;

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}dateqtr {c |}{res}         1           0           .          0          0
{txt}
{com}. local zero`recnum'perdate = r(mean) ;
{txt}
{com}. local rec`recnum'firstperdate = `zero`recnum'perdate' - (365*2) - 10 ;
{txt}
{com}. local rec`recnum'lastperdate  = `zero`recnum'perdate' + (365*6) + 10 ;
{txt}
{com}. count if dateqtr >= `rec`recnum'firstperdate' & dateqtr <= `rec`recnum'lastperdate' ;
{res}   33
{txt}
{com}. local rec`recnum'pers = r(N) ;
{txt}
{com}. gen rGDPqtrrec`recnum' = rGDPqtr/`rec`recnum'max' if dateqtr >=
>    `rec`recnum'firstperdate' & dateqtr <= `rec`recnum'lastperdate' ;
{txt}(314 missing values generated)

{com}. label variable rGDPqtrrec`recnum' "1958-1964" ;
{txt}
{com}. gen comprecper`recnum' =  dateqtr - `zero`recnum'perdate' if dateqtr >=
>    `rec`recnum'firstperdate' & dateqtr <= `rec`recnum'lastperdate' ;
{txt}(314 missing values generated)

{com}. label variable comprecper`recnum' "Days from peak" ;
{txt}
{com}. *---------------------------------------------------------------------------- ;
. * Create normalized peak series for Recession 8 (Dec 1969-Nov 1970) ;
. local recnum = 8 ;
{txt}
{com}. *graph twoway line rGDPqtr dateqtr if dateqtr >= mdy(1,1,1969) &
>    dateqtr <= mdy(1,1,1970) ;
. sum rGDPqtr if dateqtr >= mdy(1,1,1969) & dateqtr <= mdy(1,1,1970) ;

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}rGDPqtr {c |}{res}         5    4706.907    16.24546   4687.098   4731.549
{txt}
{com}. local rec`recnum'max = r(max) ;
{txt}
{com}. display `rec`recnum'max' ;
{res}4731.5488
{txt}
{com}. sum periodqtr if rGDPqtr == `rec`recnum'max' & dateqtr >= mdy(1,1,1969) &
>    dateqtr <= mdy(1,1,1970) ;

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}periodqtr {c |}{res}         1         171           .        171        171
{txt}
{com}. local zero`recnum'per = r(min) ;
{txt}
{com}. display `zero`recnum'per' ;
{res}171
{txt}
{com}. sum dateqtr if periodqtr == `zero`recnum'per' ;

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}dateqtr {c |}{res}         1        3469           .       3469       3469
{txt}
{com}. local zero`recnum'perdate = r(mean) ;
{txt}
{com}. local rec`recnum'firstperdate = `zero`recnum'perdate' - (365*2) - 10 ;
{txt}
{com}. local rec`recnum'lastperdate  = `zero`recnum'perdate' + (365*6) + 10 ;
{txt}
{com}. count if dateqtr >= `rec`recnum'firstperdate' & dateqtr <= `rec`recnum'lastperdate' ;
{res}   33
{txt}
{com}. local rec`recnum'pers = r(N) ;
{txt}
{com}. gen rGDPqtrrec`recnum' = rGDPqtr/`rec`recnum'max' if dateqtr >=
>    `rec`recnum'firstperdate' & dateqtr <= `rec`recnum'lastperdate' ;
{txt}(314 missing values generated)

{com}. label variable rGDPqtrrec`recnum' "1967-1973" ;
{txt}
{com}. gen comprecper`recnum' =  dateqtr - `zero`recnum'perdate' if dateqtr >=
>    `rec`recnum'firstperdate' & dateqtr <= `rec`recnum'lastperdate' ;
{txt}(314 missing values generated)

{com}. label variable comprecper`recnum' "Days from peak" ;
{txt}
{com}. *---------------------------------------------------------------------------- ;
. * Create normalized peak series for Recession 9 (Nov 1973-Mar 1975) ;
. local recnum = 9 ;
{txt}
{com}. *graph twoway line rGDPqtr dateqtr if dateqtr >= mdy(7,1,1973) &
>    dateqtr <= mdy(1,1,1974) ;
. sum rGDPqtr if dateqtr >= mdy(7,1,1973) & dateqtr <= mdy(1,1,1974) ;

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}rGDPqtr {c |}{res}         3    5424.572    27.75803   5406.065   5456.489
{txt}
{com}. local rec`recnum'max = r(max) ;
{txt}
{com}. display `rec`recnum'max' ;
{res}5456.4888
{txt}
{com}. sum periodqtr if rGDPqtr == `rec`recnum'max' & dateqtr >= mdy(7,1,1973) &
>    dateqtr <= mdy(1,1,1974) ;

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}periodqtr {c |}{res}         1         188           .        188        188
{txt}
{com}. local zero`recnum'per = r(min) ;
{txt}
{com}. display `zero`recnum'per' ;
{res}188
{txt}
{com}. sum dateqtr if periodqtr == `zero`recnum'per' ;

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}dateqtr {c |}{res}         1        5022           .       5022       5022
{txt}
{com}. local zero`recnum'perdate = r(mean) ;
{txt}
{com}. local rec`recnum'firstperdate = `zero`recnum'perdate' - (365*2) - 10 ;
{txt}
{com}. local rec`recnum'lastperdate  = `zero`recnum'perdate' + (365*6) + 10 ;
{txt}
{com}. count if dateqtr >= `rec`recnum'firstperdate' & dateqtr <= `rec`recnum'lastperdate' ;
{res}   33
{txt}
{com}. local rec`recnum'pers = r(N) ;
{txt}
{com}. gen rGDPqtrrec`recnum' = rGDPqtr/`rec`recnum'max' if dateqtr >=
>    `rec`recnum'firstperdate' & dateqtr <= `rec`recnum'lastperdate' ;
{txt}(314 missing values generated)

{com}. label variable rGDPqtrrec`recnum' "1971-1977" ;
{txt}
{com}. gen comprecper`recnum' =  dateqtr - `zero`recnum'perdate' if dateqtr >=
>    `rec`recnum'firstperdate' & dateqtr <= `rec`recnum'lastperdate' ;
{txt}(314 missing values generated)

{com}. label variable comprecper`recnum' "Days from peak" ;
{txt}
{com}. *---------------------------------------------------------------------------- ;
. * Create normalized peak series for Recession 10 (Jan 1980-Jul 1980) ;
. local recnum = 10 ;
{txt}
{com}. *graph twoway line rGDPqtr dateqtr if dateqtr >= mdy(1,1,1979) &
>    dateqtr <= mdy(7,1,1980) ;
. sum rGDPqtr if dateqtr >= mdy(1,1,1979) & dateqtr <= mdy(7,1,1980) ;

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}rGDPqtr {c |}{res}         7    6445.195    54.75872   6375.988   6517.864
{txt}
{com}. local rec`recnum'max = r(max) ;
{txt}
{com}. display `rec`recnum'max' ;
{res}6517.8638
{txt}
{com}. sum periodqtr if rGDPqtr == `rec`recnum'max' & dateqtr >= mdy(1,1,1979) &
>    dateqtr <= mdy(7,1,1980) ;

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}periodqtr {c |}{res}         1         213           .        213        213
{txt}
{com}. local zero`recnum'per = r(min) ;
{txt}
{com}. display `zero`recnum'per' ;
{res}213
{txt}
{com}. sum dateqtr if periodqtr == `zero`recnum'per' ;

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}dateqtr {c |}{res}         1        7305           .       7305       7305
{txt}
{com}. local zero`recnum'perdate = r(mean) ;
{txt}
{com}. local rec`recnum'firstperdate = `zero`recnum'perdate' - (365*2) - 10 ;
{txt}
{com}. local rec`recnum'lastperdate  = `zero`recnum'perdate' + (365*6) + 10 ;
{txt}
{com}. count if dateqtr >= `rec`recnum'firstperdate' & dateqtr <= `rec`recnum'lastperdate' ;
{res}   33
{txt}
{com}. local rec`recnum'pers = r(N) ;
{txt}
{com}. gen rGDPqtrrec`recnum' = rGDPqtr/`rec`recnum'max' if dateqtr >=
>    `rec`recnum'firstperdate' & dateqtr <= `rec`recnum'lastperdate' ;
{txt}(314 missing values generated)

{com}. label variable rGDPqtrrec`recnum' "1978-1984" ;
{txt}
{com}. gen comprecper`recnum' =  dateqtr - `zero`recnum'perdate' if dateqtr >=
>    `rec`recnum'firstperdate' & dateqtr <= `rec`recnum'lastperdate' ;
{txt}(314 missing values generated)

{com}. label variable comprecper`recnum' "Days from peak" ;
{txt}
{com}. *---------------------------------------------------------------------------- ;
. * Create normalized peak series for Recession 11 (Jul 1981-Nov1982) ;
. local recnum = 11 ;
{txt}
{com}. *graph twoway line rGDPqtr dateqtr if dateqtr >= mdy(1,1,1981) &
>    dateqtr <= mdy(1,1,1982) ;
. sum rGDPqtr if dateqtr >= mdy(1,1,1981) & dateqtr <= mdy(1,1,1982) ;

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}rGDPqtr {c |}{res}         5    6582.113    71.79735   6468.003   6655.692
{txt}
{com}. local rec`recnum'max = r(max) ;
{txt}
{com}. display `rec`recnum'max' ;
{res}6655.6919
{txt}
{com}. sum periodqtr if rGDPqtr == `rec`recnum'max' & dateqtr >= mdy(1,1,1981) &
>    dateqtr <= mdy(1,1,1982) ;

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}periodqtr {c |}{res}         1         219           .        219        219
{txt}
{com}. local zero`recnum'per = r(min) ;
{txt}
{com}. display `zero`recnum'per' ;
{res}219
{txt}
{com}. sum dateqtr if periodqtr == `zero`recnum'per' ;

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}dateqtr {c |}{res}         1        7852           .       7852       7852
{txt}
{com}. local zero`recnum'perdate = r(mean) ;
{txt}
{com}. local rec`recnum'firstperdate = `zero`recnum'perdate' - (365*2) - 10 ;
{txt}
{com}. local rec`recnum'lastperdate  = `zero`recnum'perdate' + (365*6) + 10 ;
{txt}
{com}. count if dateqtr >= `rec`recnum'firstperdate' & dateqtr <= `rec`recnum'lastperdate' ;
{res}   33
{txt}
{com}. local rec`recnum'pers = r(N) ;
{txt}
{com}. gen rGDPqtrrec`recnum' = rGDPqtr/`rec`recnum'max' if dateqtr >=
>    `rec`recnum'firstperdate' & dateqtr <= `rec`recnum'lastperdate' ;
{txt}(314 missing values generated)

{com}. label variable rGDPqtrrec`recnum' "1979-1985" ;
{txt}
{com}. gen comprecper`recnum' =  dateqtr - `zero`recnum'perdate' if dateqtr >=
>    `rec`recnum'firstperdate' & dateqtr <= `rec`recnum'lastperdate' ;
{txt}(314 missing values generated)

{com}. label variable comprecper`recnum' "Days from peak" ;
{txt}
{com}. *---------------------------------------------------------------------------- ;
. * Create normalized peak series for Recession 12 (Jul 1990-Mar 1991) ;
. local recnum = 12 ;
{txt}
{com}. *graph twoway line rGDPqtr dateqtr if dateqtr >= mdy(1,1,1989) &
>    dateqtr <= mdy(1,1,1991) ;
. sum rGDPqtr if dateqtr >= mdy(1,1,1989) & dateqtr <= mdy(1,1,1991) ;

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}rGDPqtr {c |}{res}         9    8860.645    96.83031   8688.396   8974.327
{txt}
{com}. local rec`recnum'max = r(max) ;
{txt}
{com}. display `rec`recnum'max' ;
{res}8974.3271
{txt}
{com}. sum periodqtr if rGDPqtr == `rec`recnum'max' & dateqtr >= mdy(1,1,1989) &
>    dateqtr <= mdy(1,1,1991) ;

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}periodqtr {c |}{res}         1         255           .        255        255
{txt}
{com}. local zero`recnum'per = r(min) ;
{txt}
{com}. display `zero`recnum'per' ;
{res}255
{txt}
{com}. sum dateqtr if periodqtr == `zero`recnum'per' ;

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}dateqtr {c |}{res}         1       11139           .      11139      11139
{txt}
{com}. local zero`recnum'perdate = r(mean) ;
{txt}
{com}. local rec`recnum'firstperdate = `zero`recnum'perdate' - (365*2) - 10 ;
{txt}
{com}. local rec`recnum'lastperdate  = `zero`recnum'perdate' + (365*6) + 10 ;
{txt}
{com}. count if dateqtr >= `rec`recnum'firstperdate' & dateqtr <= `rec`recnum'lastperdate' ;
{res}   33
{txt}
{com}. local rec`recnum'pers = r(N) ;
{txt}
{com}. gen rGDPqtrrec`recnum' = rGDPqtr/`rec`recnum'max' if dateqtr >=
>    `rec`recnum'firstperdate' & dateqtr <= `rec`recnum'lastperdate' ;
{txt}(314 missing values generated)

{com}. label variable rGDPqtrrec`recnum' "1989-1995" ;
{txt}
{com}. gen comprecper`recnum' =  dateqtr - `zero`recnum'perdate' if dateqtr >=
>    `rec`recnum'firstperdate' & dateqtr <= `rec`recnum'lastperdate' ;
{txt}(314 missing values generated)

{com}. label variable comprecper`recnum' "Days from peak" ;
{txt}
{com}. *---------------------------------------------------------------------------- ;
. * Create normalized peak series for Recession 13 (Mar 2001-Nov 2001) ;
. local recnum = 13 ;
{txt}
{com}. *graph twoway line rGDPqtr dateqtr if dateqtr >= mdy(1,1,2001) &
>    dateqtr <= mdy(7,1,2001) ;
. sum rGDPqtr if dateqtr >= mdy(1,1,2001) & dateqtr <= mdy(7,1,2001) ;

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}rGDPqtr {c |}{res}         3    12677.52    33.69748   12645.65   12712.79
{txt}
{com}. local rec`recnum'max = r(max) ;
{txt}
{com}. display `rec`recnum'max' ;
{res}12712.787
{txt}
{com}. sum periodqtr if rGDPqtr == `rec`recnum'max' & dateqtr >= mdy(1,1,2001) &
>    dateqtr <= mdy(7,1,2001) ;

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}periodqtr {c |}{res}         1         298           .        298        298
{txt}
{com}. local zero`recnum'per = r(min) ;
{txt}
{com}. display `zero`recnum'per' ;
{res}298
{txt}
{com}. sum dateqtr if periodqtr == `zero`recnum'per' ;

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}dateqtr {c |}{res}         1       15066           .      15066      15066
{txt}
{com}. local zero`recnum'perdate = r(mean) ;
{txt}
{com}. local rec`recnum'firstperdate = `zero`recnum'perdate' - (365*2) - 10 ;
{txt}
{com}. local rec`recnum'lastperdate  = `zero`recnum'perdate' + (365*6) + 10 ;
{txt}
{com}. count if dateqtr >= `rec`recnum'firstperdate' & dateqtr <= `rec`recnum'lastperdate' ;
{res}   33
{txt}
{com}. local rec`recnum'pers = r(N) ;
{txt}
{com}. gen rGDPqtrrec`recnum' = rGDPqtr/`rec`recnum'max' if dateqtr >=
>    `rec`recnum'firstperdate' & dateqtr <= `rec`recnum'lastperdate' ;
{txt}(314 missing values generated)

{com}. label variable rGDPqtrrec`recnum' "1997-2003" ;
{txt}
{com}. gen comprecper`recnum' =  dateqtr - `zero`recnum'perdate' if dateqtr >=
>    `rec`recnum'firstperdate' & dateqtr <= `rec`recnum'lastperdate' ;
{txt}(314 missing values generated)

{com}. label variable comprecper`recnum' "Days from peak" ;
{txt}
{com}. *---------------------------------------------------------------------------- ;
. * Create normalized peak series for Recession 14 (Dec 2007-present [June 2009]) ;
. local recnum = 14 ;
{txt}
{com}. *graph twoway line rGDPqtr dateqtr if dateqtr >= mdy(12,1,2005) &
>    dateqtr <= mdy(7,31,20011) ;
. sum rGDPqtr if dateqtr >= mdy(12,1,2005) & dateqtr <= mdy(7,31,2009) ;

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}rGDPqtr {c |}{res}        15    14695.58    221.9142    14356.9   14996.05
{txt}
{com}. local rec`recnum'max = r(max) ;
{txt}
{com}. display `rec`recnum'max' ;
{res}14996.054
{txt}
{com}. sum periodqtr if rGDPqtr == `rec`recnum'max' & dateqtr >= mdy(12,1,2005) &
>    dateqtr <= mdy(7,31,2009) ;

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}periodqtr {c |}{res}         1         324           .        324        324
{txt}
{com}. local zero`recnum'per = r(min) ;
{txt}
{com}. display `zero`recnum'per' ;
{res}324
{txt}
{com}. sum dateqtr if periodqtr == `zero`recnum'per' ;

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}dateqtr {c |}{res}         1       17440           .      17440      17440
{txt}
{com}. local zero`recnum'perdate = r(mean) ;
{txt}
{com}. local rec`recnum'firstperdate = `zero`recnum'perdate' - (365*2) - 10 ;
{txt}
{com}. local rec`recnum'lastperdate  = `zero`recnum'perdate' + (365*6) + 10 ;
{txt}
{com}. *count ;
. *local newobs = r(N) + 1 ;
. *set obs `newobs' ;
. *replace dateqtr = `rec`recnum'lastperdate' if _n == `newobs' ;
. count if dateqtr >= `rec`recnum'firstperdate' & dateqtr <= `rec`recnum'lastperdate' ;
{res}   32
{txt}
{com}. local rec`recnum'pers = r(N) ;
{txt}
{com}. gen rGDPqtrrec`recnum' = rGDPqtr/`rec`recnum'max' if dateqtr >=
>    `rec`recnum'firstperdate' & dateqtr <= `rec`recnum'lastperdate' ;
{txt}(315 missing values generated)

{com}. label variable rGDPqtrrec`recnum' "2005-2009" ;
{txt}
{com}. gen comprecper`recnum' =  dateqtr - `zero`recnum'perdate' if dateqtr >=
>    `rec14firstperdate' & dateqtr <= `rec`recnum'lastperdate' ;
{txt}(315 missing values generated)

{com}. label variable comprecper`recnum' "Days from peak" ;
{txt}
{com}. save rGDPrecessComp, replace ;
{txt}file rGDPrecessComp.dta saved

{com}. *---------------------------------------------------------------------------- ;
. * Create normalized peak plot of DJIA for all recessions since the Great
>   Depression ;
. graph twoway
>    (line rGDPannrec1  comprecper1  if dateann >= `rec1firstperdate'  &
>    dateann <= `rec1lastperdate', lwidth(vthick) lcolor(black))
>    (line rGDPannrec2  comprecper2  if dateann >= `rec2firstperdate'  &
>    dateann <= `rec2lastperdate')
>    (line rGDPannrec3  comprecper3  if dateann >= `rec3firstperdate'  &
>    dateann <= `rec3lastperdate')
>    (line rGDPqtrrec4  comprecper4  if dateqtr >= `rec4firstperdate'  &
>    dateqtr <= `rec4lastperdate')
>    (line rGDPqtrrec5  comprecper5  if dateqtr >= `rec5firstperdate'  &
>    dateqtr <= `rec5lastperdate')
>    (line rGDPqtrrec6  comprecper6  if dateqtr >= `rec6firstperdate'  &
>    dateqtr <= `rec6lastperdate')
>    (line rGDPqtrrec7  comprecper7  if dateqtr >= `rec7firstperdate'  &
>    dateqtr <= `rec7lastperdate')
>    (line rGDPqtrrec8  comprecper8  if dateqtr >= `rec8firstperdate'  &
>    dateqtr <= `rec8lastperdate')
>    (line rGDPqtrrec9  comprecper9  if dateqtr >= `rec9firstperdate'  &
>    dateqtr <= `rec9lastperdate')
>    (line rGDPqtrrec10 comprecper10 if dateqtr >= `rec10firstperdate' &
>    dateqtr <= `rec10lastperdate')
>    (line rGDPqtrrec11 comprecper11 if dateqtr >= `rec11firstperdate' &
>    dateqtr <= `rec11lastperdate')
>    (line rGDPqtrrec12 comprecper12 if dateqtr >= `rec12firstperdate' &
>    dateqtr <= `rec12lastperdate')
>    (line rGDPqtrrec13 comprecper13 if dateqtr >= `rec13firstperdate' &
>    dateqtr <= `rec13lastperdate')
>    (line rGDPqtrrec14 comprecper14 if dateqtr >= `rec14firstperdate' &
>    dateqtr <= `rec14lastperdate', lwidth(vthick) lcolor(lime)),
>    title("Normalized Peak Plot") subtitle("Real GDP during last 14 recessions")
>    xline(0,lcolor(black) lpattern(dash)) yline(1,lcolor(black) lpattern(dash))
>    ytitle("real GDP/Peak") ylabel(0.70 0.85 1.00 1.15 1.30)
>    xtitle("Time from peak") xlabel(-729 "-2yr" -365 "-1yr" 0 "0" 365 "+1yr"
>    730 "+2yr" 1095 "+3yr" 1460 "+4yr" 1825 "+5yr" 2190 "+6yr")
>    legend(cols(1) position(3) symxsize(5) keygap(1) size(small) width(25))
>    note("Source: Econosseur.com, Federal Reserve Bank of St. Louis FRED data, BEA") ;
{res}{txt}
{com}. graph save rGDPrecessCompGraph14-01, replace ;
{res}{txt}(file rGDPrecessCompGraph14-01.gph saved)

{com}. graph export rGDPrecessCompGraph14-01.pdf, replace ;
{txt}(file /Users/rwe2/Documents/BYU Economics/Data/rGDPrecessComp/rGDPrecessCompGraph14-01.pdf written in PDF format)

{com}. graph export rGDPrecessCompGraph14-01.png, replace ;
{txt}(file rGDPrecessCompGraph14-01.png written in PNG format)

{com}. *---------------------------------------------------------------------------- ;
. * Closing commands ;
. log close ;
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/rwe2/Documents/BYU Economics/Data/rGDPrecessComp/rGDPrecessComp.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}27 Jan 2014, 21:31:14
{txt}{.-}
{smcl}
{txt}{sf}{ul off}